---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructureLayer.Function
source: html/7b4a274c-2ff0-2ecc-5e3b-ab1d46f3d268.htm
---
# Autodesk.Revit.DB.CompoundStructureLayer.Function Property

The function of the layer.

## Syntax (C#)
```csharp
public MaterialFunctionAssignment Function { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration